{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "output_shape": null, "arguments": {}, "input_dtype": "float32", "name": "lambda_2", "batch_input_shape": [null, 66, 200, 3], "function": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa=D:/DSUsers/uidg5371/Data/Anaconda3/CarND-Behavior-P3/model.py\u00da\b<lambda>,\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_row": 5, "nb_filter": 24, "nb_col": 5, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_6", "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_row": 5, "nb_filter": 36, "nb_col": 5, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_7", "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_7"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_row": 5, "nb_filter": 48, "nb_col": 5, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_8", "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_8"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_row": 3, "nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_9", "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_9"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_row": 3, "nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "border_mode": "same", "dim_ordering": "tf", "W_regularizer": null, "W_constraint": null, "name": "convolution2d_10", "b_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_10"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 100, "W_constraint": null, "name": "dense_5", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 50, "W_constraint": null, "name": "dense_6", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 10, "W_constraint": null, "name": "dense_7", "b_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 1, "W_constraint": null, "name": "dense_8", "b_regularizer": null, "bias": true}}]}